---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.RebarSystemOffset
source: html/5de2307d-842d-7df9-350e-7727e12048b7.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.RebarSystemOffset Property

Rebar Cover Side/Edge is too large for sketch. Bar placement may be inaccurate.

## Syntax (C#)
```csharp
public static FailureDefinitionId RebarSystemOffset { get; }
```